lotoohe-space/mkrtos-real/mkrtos_bsp/SWM34/SWM341_StdPeriph_Driver/SWM341_UsbHost_Lib/MTP/usbh_mtp.c
/****************************************************************************************************************************************** 
* 文件名称: usbh_mtp.c
* 功能说明:	This file is the MTP Layer Handlers for USB Host MTP class.
* 技术支持:	http://www.synwit.com.cn/e/tool/gbook/?bid=1
* 注意事项: 
* 版本日期:	V1.1.0		2020年11月3日
* 升级记录:  
*
*
*******************************************************************************************************************************************
* @attention
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS WITH CODING INFORMATION 
* REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME. AS A RESULT, SYNWIT SHALL NOT BE HELD LIABLE 
* FOR ANY DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE CONTENT 
* OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING INFORMATION CONTAINED HEREIN IN CONN-
* -ECTION WITH THEIR PRODUCTS.
*
* COPYRIGHT 2012 Synwit Technology
*******************************************************************************************************************************************/
#include <string.h>
#include "SWM341.h"
#include "usbh_core.h"
#include "usbh_mtp.h"


static USBH_Status USBH_MTP_Init(USBH_Info_t *phost);
static void        USBH_MTP_DeInit(USBH_Info_t *phost);
static USBH_Status USBH_MTP_Request(USBH_Info_t *phost);
static USBH_Status USBH_MTP_Process(USBH_Info_t *phost);

USBH_Class_cb_t USBH_MTP_cb =
{
	USBH_MTP_Init,
	USBH_MTP_DeInit,
	USBH_MTP_Request,
	USBH_MTP_Process,
};


USBH_MTP_Info_t USBH_MTP_Info;


/****************************************************************************************************************************************** 
* 函数名称:	USBH_MTP_Init()
* 功能说明:	
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
static USBH_Status USBH_MTP_Init(USBH_Info_t *phost)
{
    USB_EpDesc_t *pEpIn, *pEpOut, *pEpNotify;
    
    for(int i = 0; i < phost->Device.Cfg_Desc.bNumInterfaces; i++)
    {
        if(((phost->Device.Intf_Desc[i].bInterfaceClass == USB_MTP_CLASS) && (phost->Device.Intf_Desc[i].bNumEndpoints == 3)) ||
           ((phost->Device.Intf_Desc[i].bInterfaceClass == 0xFF)          && (phost->Device.Intf_Desc[i].bNumEndpoints == 3)))
        {
#define EpVerify(ep, dir, type)  (((phost->Device.Ep_Desc[i][ep].bEndpointAddress & USB_EP_IN) == dir) && \
								  ((phost->Device.Ep_Desc[i][ep].bmAttributes & USB_EP_INT) == type))
            if(EpVerify(0, USB_EP_IN, USB_EP_INT) && EpVerify(1, USB_EP_IN, USB_EP_BULK) && EpVerify(2, USB_EP_OUT, USB_EP_BULK))
            {
                pEpNotify = &phost->Device.Ep_Desc[i][0];
                pEpIn     = &phost->Device.Ep_Desc[i][1];
                pEpOut    = &phost->Device.Ep_Desc[i][2];
            }
            else if(EpVerify(0, USB_EP_IN, USB_EP_INT) && EpVerify(2, USB_EP_IN, USB_EP_BULK) && EpVerify(1, USB_EP_OUT, USB_EP_BULK))
			{
                pEpNotify = &phost->Device.Ep_Desc[i][0];
                pEpIn     = &phost->Device.Ep_Desc[i][2];
                pEpOut    = &phost->Device.Ep_Desc[i][1];
            }
            else if(EpVerify(1, USB_EP_IN, USB_EP_INT) && EpVerify(0, USB_EP_IN, USB_EP_BULK) && EpVerify(2, USB_EP_OUT, USB_EP_BULK))
            {
                pEpNotify = &phost->Device.Ep_Desc[i][1];
                pEpIn     = &phost->Device.Ep_Desc[i][0];
                pEpOut    = &phost->Device.Ep_Desc[i][2];
            }
            else if(EpVerify(1, USB_EP_IN, USB_EP_INT) && EpVerify(2, USB_EP_IN, USB_EP_BULK) && EpVerify(0, USB_EP_OUT, USB_EP_BULK))
            {
                pEpNotify = &phost->Device.Ep_Desc[i][1];
                pEpIn     = &phost->Device.Ep_Desc[i][2];
                pEpOut    = &phost->Device.Ep_Desc[i][0];
            }
            else if(EpVerify(2, USB_EP_IN, USB_EP_INT) && EpVerify(0, USB_EP_IN, USB_EP_BULK) && EpVerify(1, USB_EP_OUT, USB_EP_BULK))
            {
                pEpNotify = &phost->Device.Ep_Desc[i][2];
                pEpIn     = &phost->Device.Ep_Desc[i][0];
                pEpOut    = &phost->Device.Ep_Desc[i][1];
            }
            else if(EpVerify(2, USB_EP_IN, USB_EP_INT) && EpVerify(1, USB_EP_IN, USB_EP_BULK) && EpVerify(0, USB_EP_OUT, USB_EP_BULK))
            {
                pEpNotify = &phost->Device.Ep_Desc[i][2];
                pEpIn     = &phost->Device.Ep_Desc[i][1];
                pEpOut    = &phost->Device.Ep_Desc[i][0];
            }
            else
            {
                continue;
            }
            
            USBH_MTP_Info.InEp         = pEpIn->bEndpointAddress;
            USBH_MTP_Info.InEpSize     = pEpIn->wMaxPacketSize;
            USBH_MTP_Info.OutEp        = pEpOut->bEndpointAddress;
            USBH_MTP_Info.OutEpSize    = pEpOut->wMaxPacketSize;
            USBH_MTP_Info.NotifyEp     = pEpNotify->bEndpointAddress;
            USBH_MTP_Info.NotifyEpSize = pEpNotify->wMaxPacketSize;
			
			USBH_MTP_Info.events.poll  = pEpNotify->bInterval;
			
			SW_LOG_INFO("InEp: %x, InEpSize: %d", pEpIn->bEndpointAddress, pEpIn->wMaxPacketSize);
			SW_LOG_INFO("OutEp: %x, OutEpSize: %d", pEpOut->bEndpointAddress, pEpOut->wMaxPacketSize);
			SW_LOG_INFO("NotifyEp: %x, NotifyEpSize: %d, NotifyInterval: %d", pEpNotify->bEndpointAddress, pEpNotify->wMaxPacketSize, pEpNotify->bInterval);
			
			USBH_MTP_DeInit(phost);
            
            return USBH_OK;
        }
        else
        {
            continue;
        }
    }
    
    if(phost->usr_cb->DeviceNotSupported)
        phost->usr_cb->DeviceNotSupported();
    
    return USBH_NOT_SUPPORTED;
}


/****************************************************************************************************************************************** 
* 函数名称:	USBH_MTP_DeInit()
* 功能说明:	
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
static void USBH_MTP_DeInit(USBH_Info_t *phost)
{
	USBH_MTP_Info.is_ready = 0;
	
	USBH_MTP_Info.InEpDATAX = 0;
	USBH_MTP_Info.OutEpDATAX = 0;
	USBH_MTP_Info.NotifyEpDATAX = 0;
	
	USBH_MTP_Info.XferState = USBH_MTP_XFER_IDLE;
	USBH_MTP_Info.OpState = USBH_MTP_OP_SEND;
	
