lotoohe-space/mkrtos-real/mkrtos_bsp/SWM34/SWM341_StdPeriph_Driver/SWM341_UsbHost_Lib/MTP/usbh_mtp.c
	USBH_MTP_Info.state = USBH_MTP_GETDEVICEINFO;
	
	SW_LOG_INFO("USBH_MTP_DeInit");
}


/****************************************************************************************************************************************** 
* 函数名称:	USBH_MTP_Request()
* 功能说明:	Used for handling Standard requests for MTP class.
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
static USBH_Status USBH_MTP_Request(USBH_Info_t *phost)
{
	return USBH_OK;
}


void USBH_MTP_XferProcess(USBH_Info_t *phost);
/****************************************************************************************************************************************** 
* 函数名称:	USBH_MTP_Process()
* 功能说明:	Used for managing state machine for MTP data transfers.
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
static USBH_Status USBH_MTP_Process(USBH_Info_t *phost)
{
	USBH_Status status = USBH_BUSY;
    
	switch(USBH_MTP_Info.state)
	{
	case USBH_MTP_GETDEVICEINFO:
		status = USBH_MTP_GetDeviceInfo(phost, &USBH_MTP_Info.devinfo);
		if(status == USBH_OK)
		{
			SW_LOG_INFO("MTP Device Information");
			SW_LOG_INFO("  Standard version : %x", USBH_MTP_Info.devinfo.StandardVersion);
			SW_LOG_INFO("  Vendor ExtID : %s",     USBH_MTP_Info.devinfo.VendorExtensionID == 6 ? "MTP" : "NOT SUPPORTED");
			SW_LOG_INFO("  Functional mode : %s",  USBH_MTP_Info.devinfo.FunctionalMode == 0 ? "Standard" : "Vendor");
			SW_LOG_INFO("  Number of Supported Operation(s) : %d", USBH_MTP_Info.devinfo.OperationsSupportedNbr);
			SW_LOG_INFO("  Number of Supported Events(s) : %d",    USBH_MTP_Info.devinfo.EventsSupportedNbr);
			SW_LOG_INFO("  Number of Supported Proprieties : %d",  USBH_MTP_Info.devinfo.DevicePropertiesSupportedNbr);
			SW_LOG_INFO("  Manufacturer : %s",   USBH_MTP_Info.devinfo.Manufacturer);
			SW_LOG_INFO("  Model : %s",          USBH_MTP_Info.devinfo.Model);
			SW_LOG_INFO("  Device version : %s", USBH_MTP_Info.devinfo.DeviceVersion);
			SW_LOG_INFO("  Serial number : %s",  USBH_MTP_Info.devinfo.SerialNumber);

			USBH_MTP_Info.state = USBH_MTP_OPENSESSION;
		}
		break;
	
	case USBH_MTP_OPENSESSION:
		status = USBH_MTP_OpenSession(phost, 1);
		if(status == USBH_OK)
		{
			SW_LOG_INFO("MTP Session #1 Opened");
			
			USBH_MTP_Info.state = USBH_MTP_GETSTORAGEIDS;
		}
		break;

	case USBH_MTP_GETSTORAGEIDS:
		status = USBH_MTP_GetStorageIds(phost, &USBH_MTP_Info.storids);
		if(status == USBH_OK)
		{
			SW_LOG_INFO("Number of storage ID items : %d", USBH_MTP_Info.storids.n);
			for(int i  = 0; i < USBH_MTP_Info.storids.n; i++)
			{
				SW_LOG_INFO("storage#%d ID : %x", i, USBH_MTP_Info.storids.Storage[i]);
			}

			USBH_MTP_Info.CurrentStorage = 0;
			if(USBH_MTP_Info.storids.n)
				USBH_MTP_Info.state = USBH_MTP_GETSTORAGEINFO;
		}
		break;

	case USBH_MTP_GETSTORAGEINFO:
		status = USBH_MTP_GetStorageInfo(phost, USBH_MTP_Info.storids.Storage[USBH_MTP_Info.CurrentStorage],
								               &USBH_MTP_Info.storinfo[USBH_MTP_Info.CurrentStorage]);
		if(status == USBH_OK)
		{
			SW_LOG_INFO("Volume#%u: %s   [%s]", USBH_MTP_Info.CurrentStorage, USBH_MTP_Info.storinfo[USBH_MTP_Info.CurrentStorage].StorageDescription,
																				 USBH_MTP_Info.storinfo[USBH_MTP_Info.CurrentStorage].VolumeLabel);
			USBH_MTP_Info.is_ready = 1;
			USBH_MTP_Info.state = USBH_MTP_IDLE;
		}
		break;

	case USBH_MTP_IDLE:
		/*
		if(USBH_State() == USBR_ACK)
		{
			USBH_MTP_Info.NotifyEpDATAX ^= 1;
			
			USBH_ReadRxBuffer((uint8_t *)&USBH_MTP_Info.events.container, USBH_MTP_Info.NotifyEpSize);
			
			USBH_MTP_EventsCallback(phost, USBH_MTP_Info.events.container.code, USBH_MTP_Info.events.container.param1);
		}

		if(abs((int)USBH->FRAMENR - (int)USBH_MTP_Info.events.timer) >= USBH_MTP_Info.events.poll)
		{
			USBH_MTP_Info.events.timer = USBH->FRAMENR;

			USBH_SendInPacket(phost->Device.Address, USBH_MTP_Info.NotifyEp, USBH_MTP_Info.NotifyEpDATAX, USBH_MTP_Info.NotifyEpSize);
		}
		*/
		status = USBH_OK;
		break;
	
	case USBH_MTP_TRANSFER:
		USBH_MTP_XferProcess(phost);
		break;

	default:
		break;
	}

	return status;
}


/****************************************************************************************************************************************** 
* 函数名称: USBH_MTP_XferProcess()
* 功能说明: 
* 输    入: USBH_Info_t *phost
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void USBH_MTP_XferProcess(USBH_Info_t *phost)
{
	USBH_Resp resp;
	uint32_t size;
	
	USBH_MTP_Info.XferStatus = USBH_BUSY;
	
	switch(USBH_MTP_Info.XferState)
	{
	case USBH_MTP_XFER_OP_REQ:
		if(USBH_SendOutPacket(phost->Device.Address, USBH_MTP_Info.OutEp, USBH_MTP_Info.OutEpDATAX, (uint8_t *)&USBH_MTP_Info.op_container, USBH_MTP_Info.op_container.length))
		{
			USBH_MTP_Info.XferState = USBH_MTP_XFER_OP_REQ_WAIT;
		}
		break;

	case USBH_MTP_XFER_OP_REQ_WAIT:
		resp = USBH_State();
		if(resp == USBR_ACK)
		{
			USBH_MTP_Info.OutEpDATAX ^= 1;
			
			if(USBH_MTP_Info.flags == PTP_DP_NODATA)
			{
				USBH_MTP_Info.XferState = USBH_MTP_XFER_RESP;
			}
			else if(USBH_MTP_Info.flags == PTP_DP_SENDDATA)
			{
				USBH_MTP_Info.XferState = USBH_MTP_XFER_DATA_OUT;
			}
			else if(USBH_MTP_Info.flags == PTP_DP_GETDATA)
			{
				USBH_MTP_Info.XferState = USBH_MTP_XFER_DATA_IN;
			}
		}
		else if(resp == USBR_NAK)
		{
			USBH_MTP_Info.XferState = USBH_MTP_XFER_OP_REQ;		// Resend Request
		}
		else if(resp == USBR_STALL)
		{
			USBH_MTP_Info.XferState = USBH_MTP_XFER_ERROR;
		}
		break;

	case USBH_MTP_XFER_DATA_OUT:
		size = USBH_MTP_Info.data_len > USBH_MTP_Info.OutEpSize ? USBH_MTP_Info.OutEpSize : USBH_MTP_Info.data_len;
		if(USBH_SendOutPacket(phost->Device.Address, USBH_MTP_Info.OutEp, USBH_MTP_Info.OutEpDATAX, (uint8_t *)&USBH_MTP_Info.data_ptr, size))
		{
			USBH_MTP_Info.XferState  = USBH_MTP_XFER_DATA_OUT_WAIT;
		}
		break;

	case USBH_MTP_XFER_DATA_OUT_WAIT:
		resp = USBH_State();
		if(resp == USBR_ACK)
		{
			USBH_MTP_Info.OutEpDATAX ^= 1;
			
			if(USBH_MTP_Info.data_len > USBH_MTP_Info.OutEpSize)
			{
				USBH_MTP_Info.data_ptr += USBH_MTP_Info.OutEpSize;
				USBH_MTP_Info.data_len -= USBH_MTP_Info.OutEpSize;
			}
			else
			{
				USBH_MTP_Info.data_len = 0;
			}

