lotoohe-space/mkrtos-real/mkrtos_bsp/SWM34/SWM341_StdPeriph_Driver/SWM341_UsbHost_Lib/MTP/usbh_mtp.c
	switch(USBH_MTP_Info.OpState)
	{
	case USBH_MTP_OP_SEND:
		/* Set operation request type */
		USBH_MTP_Info.flags = PTP_DP_GETDATA;
		USBH_MTP_Info.data_ptr = (uint8_t *)(void *)&USBH_MTP_Info.data_container;
		USBH_MTP_Info.data_len = 0;
		USBH_MTP_Info.first_packet = 1;

		/* Fill operation request params */
		USBH_MTP_Info.op_container.type = PTP_USB_CONTAINER_COMMAND;
		USBH_MTP_Info.op_container.code = PTP_OC_GetStorageIDs;
		USBH_MTP_Info.op_container.trans_id = USBH_MTP_Info.transaction_id++;
		USBH_MTP_Info.op_container.length = PTP_USB_BULK_HDR_LEN + sizeof(uint32_t) * 0;

		/* Setup State machine and start transfer */
		USBH_MTP_Info.XferState = USBH_MTP_XFER_OP_REQ;
		USBH_MTP_Info.OpState = USBH_MTP_OP_WAIT;
		
		USBH_MTP_Info.stateBkp = USBH_MTP_Info.state;
		USBH_MTP_Info.state = USBH_MTP_TRANSFER;
		break;

	case USBH_MTP_OP_WAIT:
		if(USBH_MTP_Info.XferStatus != USBH_BUSY)
		{
			status = USBH_MTP_Info.XferStatus;
			USBH_MTP_Info.XferStatus = USBH_BUSY;

			USBH_MTP_Info.OpState = USBH_MTP_OP_SEND;
		}
		if(status == USBH_OK)
		{
			storage_ids->n = PTP_GetArray32(storage_ids->Storage, USBH_MTP_Info.data_container.payload, 0U);
		}
		break;

	default:
		break;
	}
	
	return status;
}


/****************************************************************************************************************************************** 
* 函数名称: USBH_MTP_GetStorageInfo()
* 功能说明: 
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
USBH_Status USBH_MTP_GetStorageInfo(USBH_Info_t *phost, uint32_t storage_id, PTP_StorageInfo_t *storage_info)
{
	USBH_Status status = USBH_BUSY;

	switch(USBH_MTP_Info.OpState)
	{
	case USBH_MTP_OP_SEND:
		/* Set operation request type */
		USBH_MTP_Info.flags = PTP_DP_GETDATA;
		USBH_MTP_Info.data_ptr = (uint8_t *)(void *)&USBH_MTP_Info.data_container;
		USBH_MTP_Info.data_len = 0;
		USBH_MTP_Info.first_packet = 1;

		/* Fill operation request params */
		USBH_MTP_Info.op_container.type = PTP_USB_CONTAINER_COMMAND;
		USBH_MTP_Info.op_container.code = PTP_OC_GetStorageInfo;
		USBH_MTP_Info.op_container.trans_id = USBH_MTP_Info.transaction_id++;
		USBH_MTP_Info.op_container.param1 = storage_id;
		USBH_MTP_Info.op_container.length = PTP_USB_BULK_HDR_LEN + sizeof(uint32_t) * 1;

		/* Setup State machine and start transfer */
		USBH_MTP_Info.XferState = USBH_MTP_XFER_OP_REQ;
		USBH_MTP_Info.OpState = USBH_MTP_OP_WAIT;
		
		USBH_MTP_Info.stateBkp = USBH_MTP_Info.state;
		USBH_MTP_Info.state = USBH_MTP_TRANSFER;
		break;

	case USBH_MTP_OP_WAIT:
		if(USBH_MTP_Info.XferStatus != USBH_BUSY)
		{
			status = USBH_MTP_Info.XferStatus;
			USBH_MTP_Info.XferStatus = USBH_BUSY;

			USBH_MTP_Info.OpState = USBH_MTP_OP_SEND;
		}
		if(status == USBH_OK)
		{
			PTP_DecodeStorageInfo(phost, storage_info);
		}
		break;

	default:
		break;
	}
	
	return status;
}


/****************************************************************************************************************************************** 
* 函数名称: USBH_MTP_GetNumObjects()
* 功能说明: 
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
USBH_Status USBH_MTP_GetNumObjects(USBH_Info_t *phost, uint32_t storage_id, uint32_t format, uint32_t folder, uint32_t *numobs)
{
	USBH_Status status = USBH_BUSY;

	switch(USBH_MTP_Info.OpState)
	{
	case USBH_MTP_OP_SEND:
		/* Set operation request type */
		USBH_MTP_Info.flags = PTP_DP_NODATA;

		/* Fill operation request params */
		USBH_MTP_Info.op_container.type = PTP_USB_CONTAINER_COMMAND;
		USBH_MTP_Info.op_container.code = PTP_OC_GetNumObjects;
		USBH_MTP_Info.op_container.trans_id = USBH_MTP_Info.transaction_id++;
		USBH_MTP_Info.op_container.param1 = storage_id;
		USBH_MTP_Info.op_container.param2 = format;
		USBH_MTP_Info.op_container.param3 = folder;
		USBH_MTP_Info.op_container.length = PTP_USB_BULK_HDR_LEN + sizeof(uint32_t) * 3;

		/* Setup State machine and start transfer */
		USBH_MTP_Info.XferState = USBH_MTP_XFER_OP_REQ;
		USBH_MTP_Info.OpState = USBH_MTP_OP_WAIT;
		
		USBH_MTP_Info.stateBkp = USBH_MTP_Info.state;
		USBH_MTP_Info.state = USBH_MTP_TRANSFER;
		break;

	case USBH_MTP_OP_WAIT:
		if(USBH_MTP_Info.XferStatus != USBH_BUSY)
		{
			status = USBH_MTP_Info.XferStatus;
			USBH_MTP_Info.XferStatus = USBH_BUSY;

			USBH_MTP_Info.OpState = USBH_MTP_OP_SEND;
		}
		if(status == USBH_OK)
		{
			*numobs = USBH_MTP_Info.resp_container.param1;
		}
		break;

	default:
		break;
	}
	
	return status;
}


/****************************************************************************************************************************************** 
* 函数名称: USBH_MTP_GetObjectHandles()
* 功能说明: 
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
USBH_Status USBH_MTP_GetObjectHandles(USBH_Info_t *phost, uint32_t storage_id, uint32_t format, uint32_t folder, PTP_ObjectHandles_t *handles)
{
	USBH_Status status = USBH_BUSY;

	switch(USBH_MTP_Info.OpState)
	{
	case USBH_MTP_OP_SEND:
		/* Set operation request type */
		USBH_MTP_Info.flags = PTP_DP_GETDATA;
		USBH_MTP_Info.data_ptr = (uint8_t *)(void *)&USBH_MTP_Info.data_container;
		USBH_MTP_Info.data_len = 0;
		USBH_MTP_Info.first_packet = 1;

		/* Fill operation request params */
		USBH_MTP_Info.op_container.type = PTP_USB_CONTAINER_COMMAND;
		USBH_MTP_Info.op_container.code = PTP_OC_GetObjectHandles;
		USBH_MTP_Info.op_container.trans_id = USBH_MTP_Info.transaction_id++;
		USBH_MTP_Info.op_container.param1 = storage_id;
		USBH_MTP_Info.op_container.param2 = format;
		USBH_MTP_Info.op_container.param3 = folder;
		USBH_MTP_Info.op_container.length = PTP_USB_BULK_HDR_LEN + sizeof(uint32_t) * 3;

		/* Setup State machine and start transfer */
		USBH_MTP_Info.XferState = USBH_MTP_XFER_OP_REQ;
		USBH_MTP_Info.OpState = USBH_MTP_OP_WAIT;
		
		USBH_MTP_Info.stateBkp = USBH_MTP_Info.state;
		USBH_MTP_Info.state = USBH_MTP_TRANSFER;
		break;

	case USBH_MTP_OP_WAIT:
		if(USBH_MTP_Info.XferStatus != USBH_BUSY)
		{
			status = USBH_MTP_Info.XferStatus;
			USBH_MTP_Info.XferStatus = USBH_BUSY;

			USBH_MTP_Info.OpState = USBH_MTP_OP_SEND;
		}
		if(status == USBH_OK)
		{
			handles->n = PTP_GetArray32(handles->Handler, USBH_MTP_Info.data_container.payload, 0U);
		}
		break;

	default:
		break;
	}
	
