lotoohe-space/mkrtos-real/mkrtos_bsp/SWM34/SWM341_StdPeriph_Driver/SWM341_UsbHost_Lib/MTP/usbh_mtp.c
	return status;
}


/****************************************************************************************************************************************** 
* 函数名称: USBH_MTP_SendObject()
* 功能说明: 
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
USBH_Status USBH_MTP_SendObject(USBH_Info_t *phost, uint32_t handle, uint8_t *object, uint32_t size)
{
	USBH_Status status = USBH_BUSY;

	switch(USBH_MTP_Info.OpState)
	{
	case USBH_MTP_OP_SEND:
		/* Set operation request type */
		USBH_MTP_Info.flags = PTP_DP_SENDDATA;
		USBH_MTP_Info.data_ptr = object;
		USBH_MTP_Info.first_packet = 1;

		/* set object control params */
		USBH_MTP_Info.data_len = size;

		/* Fill operation request params */
		USBH_MTP_Info.op_container.type = PTP_USB_CONTAINER_COMMAND;
		USBH_MTP_Info.op_container.code = PTP_OC_SendObject;
		USBH_MTP_Info.op_container.trans_id = USBH_MTP_Info.transaction_id++;
		USBH_MTP_Info.op_container.length = PTP_USB_BULK_HDR_LEN + sizeof(uint32_t) * 0;

		/* Setup State machine and start transfer */
		USBH_MTP_Info.XferState = USBH_MTP_XFER_OP_REQ;
		USBH_MTP_Info.OpState = USBH_MTP_OP_WAIT;
		
		USBH_MTP_Info.stateBkp = USBH_MTP_Info.state;
		USBH_MTP_Info.state = USBH_MTP_TRANSFER;
		break;

	case USBH_MTP_OP_WAIT:
		if(USBH_MTP_Info.XferStatus != USBH_BUSY)
		{
			status = USBH_MTP_Info.XferStatus;
			USBH_MTP_Info.XferStatus = USBH_BUSY;

			USBH_MTP_Info.OpState = USBH_MTP_OP_SEND;
		}
		break;

	default:
		break;
	}
	
	return status;
}


/****************************************************************************************************************************************** 
* 函数名称: USBH_MTP_GetDevicePropDesc()
* 功能说明: 
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
USBH_Status USBH_MTP_GetDevicePropDesc(USBH_Info_t *phost, uint16_t propcode, PTP_DevicePropDesc_t *devicepropertydesc)
{
	USBH_Status status = USBH_BUSY;

	switch(USBH_MTP_Info.OpState)
	{
	case USBH_MTP_OP_SEND:
		/* Set operation request type */
		USBH_MTP_Info.flags = PTP_DP_GETDATA;
		USBH_MTP_Info.data_ptr = (uint8_t *)(void *)&USBH_MTP_Info.data_container;
		USBH_MTP_Info.data_len = 0;
		USBH_MTP_Info.first_packet = 1;

		/* Fill operation request params */
		USBH_MTP_Info.op_container.type = PTP_USB_CONTAINER_COMMAND;
		USBH_MTP_Info.op_container.code = PTP_OC_GetDevicePropDesc;
		USBH_MTP_Info.op_container.trans_id = USBH_MTP_Info.transaction_id++;
		USBH_MTP_Info.op_container.param1 = propcode;
		USBH_MTP_Info.op_container.length = PTP_USB_BULK_HDR_LEN + sizeof(uint32_t) * 1;

		/* Setup State machine and start transfer */
		USBH_MTP_Info.XferState = USBH_MTP_XFER_OP_REQ;
		USBH_MTP_Info.OpState = USBH_MTP_OP_WAIT;
		
		USBH_MTP_Info.stateBkp = USBH_MTP_Info.state;
		USBH_MTP_Info.state = USBH_MTP_TRANSFER;
		break;

	case USBH_MTP_OP_WAIT:
		if(USBH_MTP_Info.XferStatus != USBH_BUSY)
		{
			status = USBH_MTP_Info.XferStatus;
			USBH_MTP_Info.XferStatus = USBH_BUSY;

			USBH_MTP_Info.OpState = USBH_MTP_OP_SEND;
		}
		if(status == USBH_OK)
		{
			uint8_t *data = USBH_MTP_Info.data_container.payload;
			
			devicepropertydesc->DevicePropertyCode = PTP_LE16(&data[PTP_dpd_DevicePropertyCode]);
			devicepropertydesc->DataType = PTP_LE16(&data[PTP_dpd_DataType]);
			devicepropertydesc->GetSet = *(uint8_t *)(&data[PTP_dpd_GetSet]);
			devicepropertydesc->FormFlag = PTP_DPFF_None;
		}
		break;

	default:
		break;
	}
	
	return status;
}


/****************************************************************************************************************************************** 
* 函数名称: USBH_MTP_GetObjectPropsSupported()
* 功能说明: 
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
USBH_Status USBH_MTP_GetObjectPropsSupported(USBH_Info_t *phost, uint16_t ofc, uint32_t *propnum, uint16_t *props)
{
	USBH_Status status = USBH_BUSY;

	switch(USBH_MTP_Info.OpState)
	{
	case USBH_MTP_OP_SEND:
		/* Set operation request type */
		USBH_MTP_Info.flags = PTP_DP_GETDATA;
		USBH_MTP_Info.data_ptr = (uint8_t *)(void *)&USBH_MTP_Info.data_container;
		USBH_MTP_Info.data_len = 0;
		USBH_MTP_Info.first_packet = 1;

		/* Fill operation request params */
		USBH_MTP_Info.op_container.type = PTP_USB_CONTAINER_COMMAND;
		USBH_MTP_Info.op_container.code = PTP_OC_GetObjectPropsSupported;
		USBH_MTP_Info.op_container.trans_id = USBH_MTP_Info.transaction_id++;
		USBH_MTP_Info.op_container.param1 = ofc;
		USBH_MTP_Info.op_container.length = PTP_USB_BULK_HDR_LEN + sizeof(uint32_t) * 1;

		/* Setup State machine and start transfer */
		USBH_MTP_Info.XferState = USBH_MTP_XFER_OP_REQ;
		USBH_MTP_Info.OpState = USBH_MTP_OP_WAIT;
		
		USBH_MTP_Info.stateBkp = USBH_MTP_Info.state;
		USBH_MTP_Info.state = USBH_MTP_TRANSFER;
		break;

	case USBH_MTP_OP_WAIT:
		if(USBH_MTP_Info.XferStatus != USBH_BUSY)
		{
			status = USBH_MTP_Info.XferStatus;
			USBH_MTP_Info.XferStatus = USBH_BUSY;

			USBH_MTP_Info.OpState = USBH_MTP_OP_SEND;
		}
		if(status == USBH_OK)
		{
			*propnum = PTP_GetArray16(props, USBH_MTP_Info.data_container.payload, 0U);
		}
		break;

	default:
		break;
	}
	
	return status;
}


/****************************************************************************************************************************************** 
* 函数名称: USBH_MTP_GetObjectPropDesc()
* 功能说明: 
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
USBH_Status USBH_MTP_GetObjectPropDesc(USBH_Info_t *phost, uint16_t opc, uint16_t ofc, PTP_ObjectPropDesc_t *opd)
{
	USBH_Status status = USBH_BUSY;

	switch(USBH_MTP_Info.OpState)
	{
	case USBH_MTP_OP_SEND:
		/* Set operation request type */
		USBH_MTP_Info.flags = PTP_DP_GETDATA;
		USBH_MTP_Info.data_ptr = (uint8_t *)(void *)&USBH_MTP_Info.data_container;
		USBH_MTP_Info.data_len = 0;
		USBH_MTP_Info.first_packet = 1;

		/* Fill operation request params */
		USBH_MTP_Info.op_container.type = PTP_USB_CONTAINER_COMMAND;
		USBH_MTP_Info.op_container.code = PTP_OC_GetObjectPropDesc;
		USBH_MTP_Info.op_container.trans_id = USBH_MTP_Info.transaction_id++;
		USBH_MTP_Info.op_container.param1 = opc;
		USBH_MTP_Info.op_container.param2 = ofc;
		USBH_MTP_Info.op_container.length = PTP_USB_BULK_HDR_LEN + sizeof(uint32_t) * 2;

		/* Setup State machine and start transfer */
		USBH_MTP_Info.XferState = USBH_MTP_XFER_OP_REQ;
		USBH_MTP_Info.OpState = USBH_MTP_OP_WAIT;
		
		USBH_MTP_Info.stateBkp = USBH_MTP_Info.state;
		USBH_MTP_Info.state = USBH_MTP_TRANSFER;
		break;

	case USBH_MTP_OP_WAIT:
		if(USBH_MTP_Info.XferStatus != USBH_BUSY)
		{
			status = USBH_MTP_Info.XferStatus;
			USBH_MTP_Info.XferStatus = USBH_BUSY;

			USBH_MTP_Info.OpState = USBH_MTP_OP_SEND;
		}
		if(status == USBH_OK)
		{
			PTP_DecodeObjectPropDesc(phost, opd, USBH_MTP_Info.data_len);
		}
		break;

	default:
		break;
	}
	
