lotoohe-space/mkrtos-real/mkrtos_bsp/SWM34/SWM341_StdPeriph_Driver/SWM341_UsbHost_Lib/MTP/usbh_mtp.c
	return status;
}


/****************************************************************************************************************************************** 
* 函数名称: USBH_MTP_GetObjectPropList()
* 功能说明: 
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
USBH_Status USBH_MTP_GetObjectPropList(USBH_Info_t *phost, uint32_t handle, MTP_Properties_t *pprops, uint32_t *nrofprops)
{
	USBH_Status status = USBH_BUSY;

	switch(USBH_MTP_Info.OpState)
	{
	case USBH_MTP_OP_SEND:
		/* Set operation request type */
		USBH_MTP_Info.flags = PTP_DP_GETDATA;
		USBH_MTP_Info.data_ptr = (uint8_t *)(void *)&USBH_MTP_Info.data_container;
		USBH_MTP_Info.data_len = 0;
		USBH_MTP_Info.first_packet = 1;

		/* Fill operation request params */
		USBH_MTP_Info.op_container.type = PTP_USB_CONTAINER_COMMAND;
		USBH_MTP_Info.op_container.code = PTP_OC_GetObjPropList;
		USBH_MTP_Info.op_container.trans_id = USBH_MTP_Info.transaction_id++;
		USBH_MTP_Info.op_container.param1 = handle;
		USBH_MTP_Info.op_container.param2 = 0x00000000U;  /* 0x00000000U should be "all formats" */
		USBH_MTP_Info.op_container.param3 = 0xFFFFFFFFU;  /* 0xFFFFFFFFU should be "all properties" */
		USBH_MTP_Info.op_container.param4 = 0x00000000U;
		USBH_MTP_Info.op_container.param5 = 0xFFFFFFFFU;  /* Return full tree below the Param1 handle */
		USBH_MTP_Info.op_container.length = PTP_USB_BULK_HDR_LEN + sizeof(uint32_t) * 5;

		/* Setup State machine and start transfer */
		USBH_MTP_Info.XferState = USBH_MTP_XFER_OP_REQ;
		USBH_MTP_Info.OpState = USBH_MTP_OP_WAIT;
		
		USBH_MTP_Info.stateBkp = USBH_MTP_Info.state;
		USBH_MTP_Info.state = USBH_MTP_TRANSFER;
		break;

	case USBH_MTP_OP_WAIT:
		if(USBH_MTP_Info.XferStatus != USBH_BUSY)
		{
			status = USBH_MTP_Info.XferStatus;
			USBH_MTP_Info.XferStatus = USBH_BUSY;

			USBH_MTP_Info.OpState = USBH_MTP_OP_SEND;
		}
		if(status == USBH_OK)
		{
			PTP_DecodeObjectPropList(phost, pprops, USBH_MTP_Info.data_len);
		}
		break;

	default:
		break;
	}
	
	return status;
}


/****************************************************************************************************************************************** 
* 函数名称:	USBH_MTP_EventsCallback()
* 功能说明:	The function informs that host has received an event
* 输    入: 无
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
__attribute__((weak)) void USBH_MTP_EventsCallback(USBH_Info_t *phost, uint32_t event, uint32_t param)
{
}
